[
  {
    "idHadith": 1,
    "titreHadith": "Les actions ne valent que par leurs intentions",
    "descriptionHadith": "Les actes ne valent que par les\nintentions et à chacun selon son intention. Celui dont l'émigration a pour fin Allah et\nSon Envoyé, son émigration sera composée comme étant pour Allah et Son Envoyé.\nCelui dont l'émigration a pour fin un bas-monde qu'il atteint, ou une femme qu'il\népouse, son émigration ne sera comptée que ce vers quoi il a émigré",
    "rapporteur": "Omar Ibn al Khattâb",
    "arabVersion": "عَنْ أَمِيرِ الْمُؤْمِنِينَ أَبِي حَفْصٍ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللهُ عَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ:  » إنَّمَا الْأَعْمَالُ بِالنِّيَّاتِ، وَإِنَّمَا لِكُلِّ امْرِئٍ مَا نَوَى، فَمَنْ كَانَتْ هِجْرَتُهُ إلَى اللَّهِ وَرَسُولِهِ فَهِجْرَتُهُ إلَى اللَّهِ وَرَسُولِهِ، وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا يُصِيبُهَا أَوْ امْرَأَةٍ يَنْكِحُهَا فَهِجْرَتُهُ إلَى مَا هَاجَرَ إلَيْهِ »."
  },
  {
    "idHadith": 2,
    "titreHadith": "Le licite et l'illicite",
    "descriptionHadith": " « J‟ai entendu l‟Envoyé de\nDieu -sallâ l-Lahû ‘aleyhi wa sallam- dire : « Les choses licites sont bien évidentes et les\nchoses illicites sont bien évidentes. Entre les deux, il y a des choses équivoques que\nbeaucoup de gens ignorent. Ainsi quiconque se met à l’abri des choses équivoques,\npréserve sa religion et son honneur. Et quiconque s’est laissé tomber dans les choses\néquivoques tombera dans les choses illicites, comme le berger qui fait paître son\ntroupeau autour d’un enclos réservé, risquant à tout moment de l’empiéter. Or, chaque\nsouverain a un domaine réservé : celui de Dieu est l’ensemble de Ses interdits. N’est-ce\npas qu’il y a dans le corps humain un morceau de chair –mudgha- qui, s’il est bon, tout\nle corps le sera et s’il est corrompu, tout le corps le sera ? N’est-ce pas que c’est le cœur\n? »",
    "rapporteur": "Abû Abd Allah an-Nouamân Ibn Bashîr",
    "arabVersion": "عَنْ أَبِي عَبْدِ اللَّهِ النُّعْمَانِ بْنِ بَشِيرٍ رَضِيَ اللَّهُ عَنْهُمَا، قَالَ: سَمِعْت رَسُولَ اللَّهِ صلى الله عليه و سلم يَقُولُ: « إنَّ الْحَلَالَ بَيِّنٌ، وَإِنَّ الْحَرَامَ بَيِّنٌ، وَبَيْنَهُمَا أُمُورٌ مُشْتَبِهَاتٌ لَا يَعْلَمُهُنَّ كَثِيرٌ مِنْ النَّاسِ، فَمَنْ اتَّقَى الشُّبُهَاتِ فَقْد اسْتَبْرَأَ لِدِينِهِ وَعِرْضِهِ، وَمَنْ وَقَعَ فِي الشُّبُهَاتِ وَقَعَ فِي الْحَرَامِ، كَالرَّاعِي يَرْعَى حَوْلَ الْحِمَى يُوشِكُ أَنْ يَرْتَعَ فِيهِ، أَلَا وَإِنَّ لِكُلِّ مَلِكٍ حِمًى، أَلَا وَإِنَّ حِمَى اللَّهِ مَحَارِمُهُ، أَلَا وَإِنَّ فِي الْجَسَدِ مُضْغَةً إذَا صَلَحَتْ صَلَحَ الْجَسَدُ كُلُّهُ، وَإذَا فَسَدَتْ فَسَدَ الْجَسَدُ كُلُّهُ، أَلَا وَهِيَ الْقَلْبُ »."
  },
  {
    "idHadith": 3,
    "titreHadith": "Le scrupule",
    "descriptionHadith": "« J'ai gardé dans ma mémoire de\nl'Envoyé d'Allah -sallâ l-Lahû ‘aleyhi wa sallam- ces paroles : « Renonce à ce qui t'inspire\ndu doute pour ce qui t'en inspire pas ».",
    "rapporteur": "Abû Muhammad al Hasan Ibn Ali",
    "arabVersion": "عَنْ أَبِي مُحَمَّدٍ الْحَسَنِ بْنِ عَلِيِّ بْنِ أَبِي طَالِبٍ سِبْطِ رَسُولِ اللَّهِ صلى الله عليه و سلم وَرَيْحَانَتِهِ رَضِيَ اللَّهُ عَنْهُمَا، قَالَ: حَفِظْت مِنْ رَسُولِ اللَّهِ صلى الله عليه و سلم « دَعْ مَا يُرِيبُك إلَى مَا لَا يُرِيبُك »."
  },
  {
    "idHadith": 4,
    "titreHadith": "La foi parfaite",
    "descriptionHadith": "« Aucun de vous ne croira jusqu’à ce qu’il aime pour son frère ce qu’il\naime pour lui-même »",
    "rapporteur": "Abû Hamza Anas ibn Mâlik",
    "arabVersion": "عَنْ أَبِي حَمْزَةَ أَنَسِ بْنِ مَالِكٍ رَضِيَ اللهُ عَنْهُ خَادِمِ رَسُولِ اللَّهِ صلى الله عليه و سلم عَنْ النَّبِيِّ صلى الله عليه و سلم قَالَ: « لَا يُؤْمِنُ أَحَدُكُمْ حَتَّى يُحِبَّ لِأَخِيهِ مَا يُحِبُّ لِنَفْسِهِ »."
  }
]
